"use strict";

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface, Sequelize) {
    await queryInterface.bulkInsert(
      "fertilizes",
      [
        {
          id:1,
          cropId:63,
          stage:1,
          content:"<p>每斗地約施堆肥1,000公斤、麩粉及骨粉各90公斤</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:2,
          cropId:63,
          stage:3,
          content:"<p>定植後2星期至初果出現 - 每2星期追施有機肥料 (N:P:K:MgO=4:3:3:1)；每株 100克</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:3,
          cropId:63,
          stage:4,
          content:"<p>每2星期追施有機肥料(N:P:K=9:3:7 或 4:2:10) 及骨粉；每株 100克</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:4,
          cropId:63,
          stage:5,
          content:"<p>每2星期追施有機肥料(N:P:K=9:3:7 或 4:2:10) 及骨粉；每株 100克</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:5,
          cropId:1,
          stage:1,
          content:"<p>每公畝苗床可施用適量充分腐熟堆肥或有機質肥料（按不同牌推薦用量及土壤肥力決定）、氯化鉀5公斤及過磷酸鈣20公斤作為基肥</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:6,
          cropId:1,
          stage:2,
          content:"<p>幼苗移植前10天左右，施用過磷酸鈣作追肥，可使蔥苗健壯",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:7,
          cropId:1,
          stage:3,
          content:"<p>鉀肥的施用可使植株強健，蔥球充實，增加抗病力和貯藏力，鉀肥施用不足時，蔥葉易變成淡黃褐色。鉀肥的施用宜在氮肥施用後，葉片生長旺盛前施用鉀肥肥效較佳，因此從植株生育期到蔥球發育期間皆應適量施用。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:8,
          cropId:1,
          stage:4,
          content:"<p>鉀肥的施用可使植株強健，蔥球充實，增加抗病力和貯藏力，鉀肥施用不足時，蔥葉易變成淡黃褐色。鉀肥的施用宜在氮肥施用後，葉片生長旺盛前施用鉀肥肥效較佳，因此從植株生育期到蔥球發育期間皆應適量施用。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:9,
          cropId:62,
          stage:3,
          content:"<p>洋蔥磷肥的施用可促進根部發育，提早結球與肥大。磷肥不足，則洋蔥植株矮化，根及葉部生育不良，植株呈現濃綠色，蔥球也不肥大；磷肥過多，則植株容易罹病。磷肥的施用時機為洋蔥生育初期至結球初期，目前洋蔥栽培全期磷肥用總推薦量每10公畝約15公斤到20公斤。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:10,
          cropId:62,
          stage:4,
          content:"<p>洋蔥磷肥的施用可促進根部發育，提早結球與肥大。磷肥不足，則洋蔥植株矮化，根及葉部生育不良，植株呈現濃綠色，蔥球也不肥大；磷肥過多，則植株容易罹病。磷肥的施用時機為洋蔥生育初期至結球初期，目前洋蔥栽培全期磷肥用總推薦量每10公畝約15公斤到20公斤。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },
        {
          id:11,
          cropId:1,
          stage:1,
          content:"<p>定植前一星期，本田每10公畝（約1分地）可施用適量充分腐熟堆肥或有機質肥料，及過磷酸鈣、台肥1號複合肥料各40公斤作為基肥</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:12,
          cropId:1,
          stage:0,
          content:"<p>氮肥不足時，洋蔥植株葉色淡黃，葉尖容易焦枯，植株矮小，提早結球，產量降低；氮肥施用過多，則容易造成葉部徒長，頸部和莖盤部位粗大，延遲結球和休眠，分球率增加，球質鬆軟，缺乏光澤，外層鱗片易破裂不耐貯運。因此，氮肥的施用量及用時期影響洋蔥產量及品質甚大，目前洋蔥栽培全期氮肥施用總推薦量每10公畝約15公斤到20公斤。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:13,
          cropId:1,
          stage:4,
          content:"<p>於蔥球肥大期視生育需要酌量噴施0.37％尿素液</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:14,
          cropId:2,
          stage:1,
          content:"<p>強酸性土壤pH值5.0以下需施用石灰石粉2-3公噸/公頃播種前二星期全面混入土中。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:15,
          cropId:2,
          stage:3,
          content:"<p>玉米對鉀的吸收，在節間伸長期～抽穗開花期，達吸收高峰，在後期（植株成熟）則吸收率差，所以鉀肥應施在前期，後期沒有施鉀肥的必要。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:16,
          cropId:2,
          stage:4,
          content:"<p>玉米對鉀的吸收，在節間伸長期～抽穗開花期，達吸收高峰，在後期（植株成熟）則吸收率差，所以鉀肥應施在前期，後期沒有施鉀肥的必要。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:17,
          cropId:2,
          stage:1,
          content:"<p>每公頃三要素施用量分別為氮肥 40-60公斤、磷酐40-70公斤、氧化鉀30-40公斤。氮肥之35%及磷、鉀肥全量當基肥施用</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:18,
          cropId:2,
          stage:3,
          content:"<p>每公頃氮肥 40-60公斤，播種後20天及開花初期，氮肥分別於，各施用30%及35%</p><p>播種後20天及開花初期，每公頃各施用尿素30-40公斤。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:19,
          cropId:4,
          stage:1,
          content:"<p>公頃用量氮素 45~75 公斤，磷酐 40~80 公斤，氧化鉀 20~30 公斤(或台肥複合肥料1號 8-10包)及其他有機質肥料8000-12000公斤(400-600 包)，整地前或播種時施用。 </p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:20,
          cropId:4,
          day: 25,
          stage:3,
          content:"<p>播種後 25~30 天，中耕培土時施用，公頃用量氮素 45~75 公斤，氧化鉀 20~30 公斤(或台肥複合肥料 1 號 8-10 包)。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:21,
          cropId:5,
          day: 70,
          stage:4,
          content:"<p>播種後 70 天施用穗肥。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:22,
          cropId:6,
          stage:1,
          content:"<p>有機栽培法以有機肥用量以N：P2O5：K2O=4.9：2.1：1.9含量之有機質肥料為例，每公頃施1,000~1,300公斤；基肥以二分之一有機肥料於播種前10天施用並掩埋入土。</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:23,
          cropId:6,
          stage:2,
          content:"<p>有機栽培法以有機肥用量以N：P2O5：K2O=4.9：2.1：1.9含量之有機質肥料為例，每公頃施1,000~1,300公斤；二分之一於有機肥料於種後20天施用。</p></p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        },{
          id:24,
          cropId:6,
          stage:1,
          content:"<p> 土壤 pH 值低於 5.5 以下時，每公頃應施用1∼2 公噸農用石灰，以提高土壤 pH 值。農用石灰於播種前 1∼2 週全面撒施後翻耕整地</p>",   
          createdAt: "2023-07-30",
          updatedAt: "2023-07-30",
        }
      ],
      {}
    );
  },

  async down(queryInterface, Sequelize) {
    /**
     * Add commands to revert seed here.
     *
     * Example:
     * await queryInterface.bulkDelete('People', null, {});
     */
  },
};
